# Remove Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
BindingMap..::..Remove Method
BindingMap Class See Also
---
The Remove method is used to remove a parameter binding.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Remove(
	Definition key
)
```

Visual Basic
---
```text
Public Overridable Function Remove ( _
	key As Definition _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Remove(
	Definition^ key
)
```

# ### Parameters
key
    Type: Autodesk.Revit.DB..::..Definition A parameter definition which can be an existing definition or one from a shared parameters file.
# See Also
BindingMap Class
Autodesk.Revit.DB Namespace